Tekla Open API Reference for Tekla Structures 2025
DeformingData.Angle2 Property
 The angle of the part at its end point, relative to the part reference line.
For example, if the beam is warped 45 degrees at the end point, in the Angle field the value is 0, and the value is 45 in the Angle2 field.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Angle2 { get; set; }
Public Property Angle2 As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
DeformingData Class
Tekla.Structures.Model Namespace